Revit 2024 API
BuiltInFailures.EnergyAnalysisFailures.RoomGeometryCannotTrimBoundingElement Property
 An error occurred while trimming the vertical shadow of a room-bounding element [Name] of the bounding geometry for [Room].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoomGeometryCannotTrimBoundingElement { get; }
Visual Basic
Public Shared ReadOnly Property RoomGeometryCannotTrimBoundingElement As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoomGeometryCannotTrimBoundingElement {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace